Generates a hash code for this Guid-based enum object.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public override int GetHashCode()
  Visual Basic
Public Overrides Function GetHashCode As Integer
  Visual C++
public:
virtual int GetHashCode() override
 See Also
  GuidEnum Class
  Autodesk.Revit.DB Namespace